contiki-os/contiki/cc26xxware/inc/hw_ssi.h
// Field: [2]    RNE
//
// Receive FIFO not empty
//
// 0: Receive FIFO is empty.
// 1: Receive FIFO is not empty.
#define SSI_SR_RNE                                                  0x00000004
#define SSI_SR_RNE_BITN                                             2
#define SSI_SR_RNE_M                                                0x00000004
#define SSI_SR_RNE_S                                                2

// Field: [1]    TNF
//
// Transmit FIFO not full:
//
// 0: Transmit FIFO is full.
// 1: Transmit FIFO is not full.
#define SSI_SR_TNF                                                  0x00000002
#define SSI_SR_TNF_BITN                                             1
#define SSI_SR_TNF_M                                                0x00000002
#define SSI_SR_TNF_S                                                1

// Field: [0]    TFE
//
// Transmit FIFO empty:
//
// 0: Transmit FIFO is not empty.
// 1: Transmit FIFO is empty.
#define SSI_SR_TFE                                                  0x00000001
#define SSI_SR_TFE_BITN                                             0
#define SSI_SR_TFE_M                                                0x00000001
#define SSI_SR_TFE_S                                                0

//*****************************************************************************
//
// Register: SSI_O_CPSR
//
//*****************************************************************************
// Field: [7:0] CPSDVSR
//
// Clock prescale divisor:
// This field specifies the division factor by which the input system clock to
// SSI must be internally divided before further use.
// The value programmed into this field must be an even non-zero number (2-254).
// The least significant bit of the programmed number is hard-coded to zero. If an
// odd number is written to this register, data read back from
// this register has the least significant bit as zero.
//
#define SSI_CPSR_CPSDVSR_M                                          0x000000FF
#define SSI_CPSR_CPSDVSR_S                                          0

//*****************************************************************************
//
// Register: SSI_O_IMSC
//
//*****************************************************************************
// Field: [3]    TXIM
//
// Transmit FIFO interrupt mask:
// A read returns the current mask for transmit FIFO interrupt. On a write of 1,
// the mask for transmit FIFO interrupt is set which means the interrupt state will
// be reflected in MIS.TXMIS. A write of 0 clears the mask which means MIS.TXMIS
// will not reflect the interrupt.
#define SSI_IMSC_TXIM                                               0x00000008
#define SSI_IMSC_TXIM_BITN                                          3
#define SSI_IMSC_TXIM_M                                             0x00000008
#define SSI_IMSC_TXIM_S                                             3

// Field: [2]    RXIM
//
// Receive FIFO interrupt mask:
// A read returns the current mask for receive FIFO interrupt. On a write of 1,
// the mask for receive FIFO interrupt is set which means the interrupt state will
// be reflected in MIS.RXMIS. A write of 0 clears the mask which means MIS.RXMIS
// will not reflect the interrupt.
#define SSI_IMSC_RXIM                                               0x00000004
#define SSI_IMSC_RXIM_BITN                                          2
#define SSI_IMSC_RXIM_M                                             0x00000004
#define SSI_IMSC_RXIM_S                                             2

// Field: [1]    RTIM
//
// Receive timeout interrupt mask:
// A read returns the current mask for receive timeout interrupt. On a write of
// 1, the mask for receive timeout interrupt is set which means the interrupt state
// will be reflected in MIS.RTMIS. A write of 0 clears the mask which means
// MIS.RTMIS will not reflect the interrupt.
#define SSI_IMSC_RTIM                                               0x00000002
#define SSI_IMSC_RTIM_BITN                                          1
#define SSI_IMSC_RTIM_M                                             0x00000002
#define SSI_IMSC_RTIM_S                                             1

// Field: [0]    RORIM
//
// Receive overrun interrupt mask:
// A read returns the current mask for receive overrun interrupt. On a write of
// 1, the mask for receive overrun interrupt is set which means the interrupt state
// will be reflected in MIS.RORMIS. A write of 0 clears the mask which means
// MIS.RORMIS will not reflect the interrupt.
#define SSI_IMSC_RORIM                                              0x00000001
#define SSI_IMSC_RORIM_BITN                                         0
#define SSI_IMSC_RORIM_M                                            0x00000001
#define SSI_IMSC_RORIM_S                                            0

//*****************************************************************************
//
// Register: SSI_O_RIS
//
//*****************************************************************************
// Field: [3]    TXRIS
//
// Raw transmit FIFO interrupt status:
// The transmit interrupt is asserted when there are four or fewer valid entries
// in the transmit FIFO. The transmit interrupt is not qualified with the SSI enable
// signal. Therefore one of the following ways can be used:
//  - data can be written to the transmit FIFO prior to enabling the SSI and the
// interrupts.
//  - SSI and interrupts can be enabled so that data can be written to the
// transmit FIFO by an interrupt service routine.
#define SSI_RIS_TXRIS                                               0x00000008
#define SSI_RIS_TXRIS_BITN                                          3
#define SSI_RIS_TXRIS_M                                             0x00000008
#define SSI_RIS_TXRIS_S                                             3

// Field: [2]    RXRIS
//
// Raw interrupt state of receive FIFO interrupt:
// The receive interrupt is asserted when there are four or more valid entries
// in the receive FIFO.
#define SSI_RIS_RXRIS                                               0x00000004
#define SSI_RIS_RXRIS_BITN                                          2
#define SSI_RIS_RXRIS_M                                             0x00000004
#define SSI_RIS_RXRIS_S                                             2

